solutions/hartshorne/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-06-23 Tue 15:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Hartshorne solutions</title>
<meta name="author" content="Jack Ceroni" />
<meta name="description" content="Directory" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Hartshorne solutions</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfb15153">1. Introduction</a></li>
<li><a href="#org5593f7c">2. Solutions</a>
<ul>
<li><a href="#orgf282fd3">2.1. Chapter 1</a></li>
<li><a href="#org356bd91">2.2. Chapter 2</a></li>
<li><a href="#orgffbca5a">2.3. Chapter 3</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgfb15153" class="outline-2">
<h2 id="orgfb15153"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
<i>Originally posted:</i> June 10th, 2026
</p>

<p>
Welcome to my solutions to the exercises in Hartshorne's algebraic geometry textbook. This project was started during the summer of 2026.
I was originally planning on doing something like this last summer, but ended up only doing a bunch of problems in Chapter 1 (and some in 2). I will include some of those Chapter 1 solutions
here, but I'm moreso focused on Chapter 2 onwards now. These solutions will all be my own work, but as I'm writing this preamble, I'm sure I'll come across some instances where I need to seek
out some external help: I'll make sure to provide attribution when this is the case. I'm also supplementing Hartshorne's book with a few other sources, most notably the book of Ellingrsud
and Ottem, <i>Introduction to Schemes</i>, as well as a few other random text/sets of notes. I'll make sure to update this page if any become particularly relevant/helpful.
</p>

<p>
By the way, I expect
many of my early solutions to be kind of bad, but I hope that as time goes on, and I become more comfortable doing this flavour of scheme-y math, they will improve!
</p>
</div>
</div>

<div id="outline-container-org5593f7c" class="outline-2">
<h2 id="org5593f7c"><span class="section-number-2">2.</span> Solutions</h2>
<div class="outline-text-2" id="text-2">
<p>
Linked are solutions to problems, sorted by chapter and section:
</p>
</div>

<div id="outline-container-orgf282fd3" class="outline-3">
<h3 id="orgf282fd3"><span class="section-number-3">2.1.</span> Chapter 1</h3>
</div>

<div id="outline-container-org356bd91" class="outline-3">
<h3 id="org356bd91"><span class="section-number-3">2.2.</span> Chapter 2</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><a href="./pdf/2-1.pdf">Section 1</a> | Current solution tally: 2/22</li>
<li><a href="./pdf/2-2.pdf">Section 2</a> | Current solution tally: 9/19</li>
<li><a href="./pdf/2-3.pdf">Section 3</a> | Current solution tally: 0/??</li>
</ul>
</div>
</div>

<div id="outline-container-orgffbca5a" class="outline-3">
<h3 id="orgffbca5a"><span class="section-number-3">2.3.</span> Chapter 3</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jack Ceroni</p>
<p class="date">Created: 2026-06-23 Tue 15:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
